<template>
    <div>
        <div v-if="showForm">
            <el-form :model="form" :rules="rules" ref="form" label-width="1px" v-loading="loading"
                     element-loading-text="正在飞速计算中">
                <p class="title">未来配对缘分测算</p>
                <el-form-item label="" prop="name">
                    <el-input class="item" v-model="form.name" placeholder="请输入姓名"></el-input>
                </el-form-item>
                <el-form-item label="" prop="sex">
                    <el-select class="item" v-model="form.sex" placeholder="请选择性别">
                        <el-option label="男" value="m"></el-option>
                        <el-option label="女" value="f"></el-option>
                    </el-select>
                </el-form-item>
                <el-form-item label="" prop="birthday">
                    <el-date-picker v-model="form.birthday" placeholder="请选择生日" style="width: 80%" type="date"
                                    :editable="false"
                                    format="yyyy 年 MM 月 dd 日"
                                    value-format="yyyyMMdd"></el-date-picker>
                </el-form-item>
                <p class="text">用姓名测试爱情，80%准确率！<br/>
                    俗话说，名如其人，缘分就是人生的后半生，为了寻找真缘分的大有人在，因此也就有了姓名缘分测试。<br/>
                    您现在是不是也正在心动犹豫，也想要一个属于自己的名字配对缘分测试了呢？那就请您赶紧行动吧！<br/>
                    存在即有理，没有用的东西也是不会存在的，天以适者生存，姓名作为人与事物的接触外延，在人生中起着一个支柱桥梁的作用。<br/>
                    名字就像是一个人的影子，这个影子的好坏将会直接影响到整个事物本身，因为如影随形。<br/>
                    雁过留声，人过留名，大家都知道中国人的姓名是由中国的汉字组成，没有汉字根本就不存在中国的姓名学，这是姓名学当中一个最根本、最直接的道理。<br/>
                    我们的名字离不开阴阳五行和八卦，读音和意境联系着我们的命运，每一笔一画都暗藏玄机，你和你心目中的他（她）是不是天生的一对，能不能够白头偕老，你们之间到底有怎样的姻缘，都能在你们的姓名中找到答案。
                </p>
                <el-form-item>
                    <el-button type="primary" @click="submitForm('form')">立即测算</el-button>
                    <el-button @click="resetForm()">重置</el-button>
                </el-form-item>
            </el-form>
        </div>
        <div v-if="!showForm" class="result">
            <p>{{resultName}}</p>
            <el-button type="primary" @click="backForm()">重新测算</el-button>
        </div>
    </div>
</template>
<script>
    export default {
        name: 'Destiny',
        data() {
            return {
                showForm: true,
                loading: false,
                resultName: 'result',
                form: {
                    name: '',
                    sex: '',
                    birthday: ''
                },
                rules: {
                    name: [
                        {required: true, message: '请输入姓名', trigger: 'blur'},
                        {required: true, min: 2, max: 8, message: '请输入正确的姓名', trigger: 'blur'}
                    ],
                    sex: [
                        {required: true, message: '请选择性别', trigger: 'blur'}
                    ],
                    birthday: [
                        {required: true, message: '请选择生日', trigger: 'blur'}
                    ]
                }
            }
        },
        methods: {
            submitForm(formName) {
                this.$refs[formName].validate((valid) => {
                    if (valid) {
                        console.log(this.form);
                        this.loading = true;
                        this.interval = setInterval(this.showResult, 3000);
                    } else {
                        console.log('error submit!!');
                        return false;
                    }
                });
            },
            resetForm() {
                this.form.name = '';
                this.form.sex = '';
                this.form.birthday = '';
            },
            showResult(){
                clearInterval(this.interval);
                this.loading = false;
                this.showForm = false;
                this.resultName = this.getResutlName(this.form);
            },
            getResutlName(form){
                if (form.name === '王铭' && form.sex === 'm' && form.birthday === '19890321') {
                    return '刘天琦';
                }
                else if (form.name === '刘天琦' && form.sex === 'f' && form.birthday === '19940806') {
                    return '王铭';
                }
                let name = this.getRandomName();
                console.log(name);
                return name;
            },
            backForm(){
                this.showForm = true;
                this.resetForm();
            },
            getRandomName(){
                let familyNames = new Array(
                    "赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈",
                    "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许",
                    "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏",
                    "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章",
                    "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦",
                    "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳",
                    "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺",
                    "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常",
                    "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余",
                    "元", "卜", "顾", "孟", "平", "黄", "和", "穆", "萧", "尹",
                    "赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈",
                    "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许",
                    "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏",
                    "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章",
                    "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦",
                    "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳",
                    "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺",
                    "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常",
                    "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余",
                    "元", "卜", "顾", "孟", "平", "黄", "和", "穆", "萧", "尹",
                    "姚", "邵", "堪", "汪", "祁", "毛", "禹", "狄", "米", "贝",
                    "明", "臧", "计", "伏", "成", "戴", "谈", "宋", "茅", "庞",
                    "熊", "纪", "舒", "屈", "项", "祝", "董", "梁");
                let givenNames = new Array(
                    "子璇", "淼", "国栋", "夫子", "瑞堂", "甜", "敏", "尚", "国贤", "贺祥", "晨涛",
                    "昊轩", "易轩", "益辰", "益帆", "益冉", "瑾春", "瑾昆", "春齐", "杨", "文昊",
                    "东东", "雄霖", "浩晨", "熙涵", "溶溶", "冰枫", "欣欣", "宜豪", "欣慧", "建政",
                    "美欣", "淑慧", "文轩", "文杰", "欣源", "忠林", "榕润", "欣汝", "慧嘉", "新建",
                    "建林", "亦菲", "林", "冰洁", "佳欣", "涵涵", "禹辰", "淳美", "泽惠", "伟洋",
                    "涵越", "润丽", "翔", "淑华", "晶莹", "凌晶", "苒溪", "雨涵", "嘉怡", "佳毅",
                    "子辰", "佳琪", "紫轩", "瑞辰", "昕蕊", "萌", "明远", "欣宜", "泽远", "欣怡",
                    "佳怡", "佳惠", "晨茜", "晨璐", "运昊", "汝鑫", "淑君", "晶滢", "润莎", "榕汕",
                    "佳钰", "佳玉", "晓庆", "一鸣", "语晨", "添池", "添昊", "雨泽", "雅晗", "雅涵",
                    "清妍", "诗悦", "嘉乐", "晨涵", "天赫", "玥傲", "佳昊", "天昊", "萌萌", "若萌",
                    "的", "一", "是", "了", "我", "不", "人", "在", "他", "有", "这", "个", "上", "们", "来", "到", "时", "大", "地", "为",
                    "子", "中", "你", "说", "生", "国", "年", "着", "就", "那", "和", "要", "她", "出", "也", "得", "里", "后", "自", "以",
                    "会", "家", "可", "下", "而", "过", "天", "去", "能", "对", "小", "多", "然", "于", "心", "学", "么", "之", "都", "好",
                    "看", "起", "发", "当", "没", "成", "只", "如", "事", "把", "还", "用", "第", "样", "道", "想", "作", "种", "开", "美",
                    "总", "从", "无", "情", "己", "面", "最", "女", "但", "现", "前", "些", "所", "同", "日", "手", "又", "行", "意", "动",
                    "方", "期", "它", "头", "经", "长", "儿", "回", "位", "分", "爱", "老", "因", "很", "给", "名", "法", "间", "斯", "知",
                    "世", "什", "两", "次", "使", "身", "者", "被", "高", "已", "亲", "其", "进", "此", "话", "常", "与", "活", "正", "感",
                    "见", "明", "问", "力", "理", "尔", "点", "文", "几", "定", "本", "公", "特", "做", "外", "孩", "相", "西", "果", "走",
                    "将", "月", "十", "实", "向", "声", "车", "全", "信", "重", "三", "机", "工", "物", "气", "每", "并", "别", "真", "打",
                    "太", "新", "比", "才", "便", "夫", "再", "书", "部", "水", "像", "眼", "等", "体", "却", "加", "电", "主", "界", "门",
                    "利", "海", "受", "听", "表", "德", "少", "克", "代", "员", "许", "稜", "先", "口", "由", "死", "安", "写", "性", "马",
                    "光", "白", "或", "住", "难", "望", "教", "命", "花", "结", "乐", "色", "更", "拉", "东", "神", "记", "处", "让", "母",
                    "父", "应", "直", "字", "场", "平", "报", "友", "关", "放", "至", "张", "认", "接", "告", "入", "笑", "内", "英", "军",
                    "候", "民", "岁", "往", "何", "度", "山", "觉", "路", "带", "万", "男", "边", "风", "解", "叫", "任", "金", "快", "原",
                    "吃", "妈", "变", "通", "师", "立", "象", "数", "四", "失", "满", "战", "远", "格", "士", "音", "轻", "目", "条", "呢",
                    "病", "始", "达", "深", "完", "今", "提", "求", "清", "王", "化", "空", "业", "思", "切", "怎", "非", "找", "片", "罗",
                    "钱", "紶", "吗", "语", "元", "喜", "曾", "离", "飞", "科", "言", "干", "流", "欢", "约", "各", "即", "指", "合", "反",
                    "题", "必", "该", "论", "交", "终", "林", "请", "医", "晚", "制", "球", "决", "窢", "传", "画", "保", "读", "运", "及",
                    "则", "房", "早", "院", "量", "苦", "火", "布", "品", "近", "坐", "产", "答", "星", "精", "视", "五", "连", "司", "巴",
                    "奇", "管", "类", "未", "朋", "且", "婚", "台", "夜", "青", "北", "队", "久", "乎", "越", "观", "落", "尽", "形", "影",
                    "红", "爸", "百", "令", "周", "吧", "识", "步", "希", "亚", "术", "留", "市", "半", "热", "送", "兴", "造", "谈", "容",
                    "极", "随", "演", "收", "首", "根", "讲", "整", "式", "取", "照", "办", "强", "石", "古", "华", "諣", "拿", "计", "您",
                    "装", "似", "足", "双", "妻", "尼", "转", "诉", "米", "称", "丽", "客", "南", "领", "节", "衣", "站", "黑", "刻", "统",
                    "断", "福", "城", "故", "历", "惊", "脸", "选", "包", "紧", "争", "另", "建", "维", "绝", "树", "系", "伤", "示", "愿",
                    "持", "千", "史", "谁", "准", "联", "妇", "纪", "基", "买", "志", "静", "阿", "诗", "独", "复", "痛", "消", "社", "算",
                    "义", "竟", "确", "酒", "需", "单", "治", "卡", "幸", "兰", "念", "举", "仅", "钟", "怕", "共", "毛", "句", "息", "功",
                    "官", "待", "究", "跟", "穿", "室", "易", "游", "程", "号", "居", "考", "突", "皮", "哪", "费", "倒", "价", "图", "具",
                    "刚", "脑", "永", "歌", "响", "商", "礼", "细", "专", "黄", "块", "脚", "味", "灵", "改", "据", "般", "破", "引", "食",
                    "仍", "存", "众", "注", "笔", "甚", "某", "沉", "血", "备", "习", "校", "默", "务", "土", "微", "娘", "须", "试", "怀",
                    "料", "调", "广", "蜖", "苏", "显", "赛", "查", "密", "议", "底", "列", "富", "梦", "错", "座", "参", "八", "除", "跑",
                    "亮", "假", "印", "设", "线", "温", "虽", "掉", "京", "初", "养", "香", "停", "际", "致", "阳", "纸", "李", "纳", "验",
                    "助", "激", "够", "严", "证", "帝", "饭", "忘", "趣", "支", "春", "集", "丈", "木", "研", "班", "普", "导", "顿", "睡",
                    "展", "跳", "获", "艺", "六", "波", "察", "群", "皇", "段", "急", "庭", "创", "区", "奥", "器", "谢", "弟", "店", "否",
                    "害", "草", "排", "背", "止", "组", "州", "朝", "封", "睛", "板", "角", "况", "曲", "馆", "育", "忙", "质", "河", "续",
                    "哥", "呼", "若", "推", "境", "遇", "雨", "标", "姐", "充", "围", "案", "伦", "护", "冷", "警", "贝", "著", "雪", "索",
                    "剧", "啊", "船", "险", "烟", "依", "斗", "值", "帮", "汉", "慢", "佛", "肯", "闻", "唱", "沙", "局", "伯", "族", "低",
                    "玩", "资", "屋", "击", "速", "顾", "泪", "洲", "团", "圣", "旁", "堂", "兵", "七", "露", "园", "牛", "哭", "旅", "街",
                    "劳", "型", "烈", "姑", "陈", "莫", "鱼", "异", "抱", "宝", "权", "鲁", "简", "态", "级", "票", "怪", "寻", "杀", "律",
                    "胜", "份", "汽", "右", "洋", "范", "床", "舞", "秘", "午", "登", "楼", "贵", "吸", "责", "例", "追", "较", "职", "属",
                    "渐", "左", "录", "丝", "牙", "党", "继", "托", "赶", "章", "智", "冲", "叶", "胡", "吉", "卖", "坚", "喝", "肉", "遗",
                    "救", "修", "松", "临", "藏", "担", "戏", "善", "卫", "药", "悲", "敢", "靠", "伊", "村", "戴", "词", "森", "耳", "差",
                    "短", "祖", "云", "规", "窗", "散", "迷", "油", "旧", "适", "乡", "架", "恩", "投", "弹", "铁", "博", "雷", "府", "压",
                    "超", "负", "勒", "杂", "醒", "洗", "采", "毫", "嘴", "毕", "九", "冰", "既", "状", "乱", "景", "席", "珍", "童", "顶",
                    "派", "素", "脱", "农", "疑", "练", "野", "按", "犯", "拍", "征", "坏", "骨", "余", "承", "置", "臓", "彩", "灯", "巨",
                    "琴", "免", "环", "姆", "暗", "换", "技", "翻", "束", "增", "忍", "餐", "洛", "塞", "缺", "忆", "判", "欧", "层", "付",
                    "阵", "玛", "批", "岛", "项", "狗", "休", "懂", "武", "革", "良", "恶", "恋", "委", "拥", "娜", "妙", "探", "呀", "营",
                    "退", "摇", "弄", "桌", "熟", "诺", "宣", "银", "势", "奖", "宫", "忽", "套", "康", "供", "优", "课", "鸟", "喊", "降",
                    "夏", "困", "刘", "罪", "亡", "鞋", "健", "模", "败", "伴", "守", "挥", "鲜", "财", "孤", "枪", "禁", "恐", "伙", "杰",
                    "迹", "妹", "藸", "遍", "盖", "副", "坦", "牌", "江", "顺", "秋", "萨", "菜", "划", "授", "归", "浪", "听", "凡", "预",
                    "奶", "雄", "升", "碃", "编", "典", "袋", "莱", "含", "盛", "济", "蒙", "棋", "端", "腿", "招", "释", "介", "烧", "误",
                    "乾", "坤");

                let nameCount = (Math.random() % 2 == 0) ? "2" : "3";
                let name1 = familyNames[Math.floor(Math.random() * familyNames.length)];
                let name2 = givenNames[Math.floor(Math.random() * givenNames.length)];
                if (nameCount === "2") {
                    let name = name1 + name2;
                    return name;
                }
                else (nameCount === "3")
                {
                    let name3 = givenNames[Math.floor(Math.random() * givenNames.length)];
                    let name = name1 + name2 + name3;
                    return name;
                }
            }
        }
    }
</script>
<style scoped>
    .title {
        margin-bottom: 40px;
    }

    .item {
        width: 80%;
    }

    .text {
        width: 90%;
        display: inline-block;
        margin-top: 10px;
        margin-bottom: 20px;
        text-align: left;
        font-size: small;
    }

    .result {
        position: fixed;
        width: 200px;
        height: 200px;
        top: 50%;
        left: 50%;
        margin-top: -100px;
        margin-left: -100px;
    }
</style>